#### CeramicType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "CeramicType" from the "Ceramic" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum CeramicType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration CeramicType ``` |

| Visual C++ |
| --- |
| ``` public enum class CeramicType ``` |

# Members

| Member name | Description |
| --- | --- |
| Ceramic |  |
| Porcelain |  |

# See Also

Autodesk.Revit.DB.Visual Namespace